
# 1. 다음 점수 구간에 맞게 학점을 출력하세요.
# 학점은 입력받은 값으로 사용
# 81 ~ 100 : A학점
# 61 ~ 80 :  B학점
# 41 ~ 60 :  C학점
# 21 ~ 40 :  D학점
#  0 ~ 20 :  E학점

# 2. 다음 세 개의 숫자 중 가장 큰수를 출력하세요.(if문 사용) : 12, 6, 18


# 3. 다음 리스트 중에서 '정' 글자를 제외하고 출력하세요.
# q = ["갑", "을", "병", "정"]

# 4. 1부터 100까지 자연수 중 '홀수'만 한 라인으로 출력 하세요.


# 5. 아래 리스트 항목 중에서 5글자 이상의 단어만 출력하세요.
# q = ["nice", "study", "python", "anaconda", "!"]

# 6 : if문과 datetime 모듈 이용
# 현재 시간을 기준으로 오전과 오후로 구분하여 출력한다.
# 예)
# 현재 시간은 오후 3시 () 분입니다.

# 7 : if문과 datetime 모듈 이용
# 월 추출 now.month
'''
import datetime
now = datetime.datetime.now()
print(' 월 =', now.month)
'''

# 달에 따라 봄, 여름, 가을 ,겨울 메세지 출력
# 12, 1,2 : 겨울
# 3~5 : 봄
# 6~8 : 여름
# 9~11 : 가을
# 예)
# 8월은 여름입니다.
